import 'package:get/utils.dart';
import 'package:smoe_app_final/core/data/model/onboarding_model.dart';

import '../../constant/images_path.dart';

List<onBoardingModel> onBoardingItme = [
  onBoardingModel(
      "تطبيق سموي -  يخليك تحتار",
      "بتدور على أكل لذيذ وسريع  سموي هو التطبيق اللي يناسبك. سموي بيوفرلك ألذ الوجبات السريعة من كل الأنواع والأذواق، من البرجر والبيتزا للفلافل والشاورما. بتقدر تختار وجبتك اللي بتحبها من قائمة فيها كل شي، وتشوف الإضافات المميزدة .. سموي بيضمنلك أنو وجبتك تكون من أحسن مايكون وبجودة عالية ."
          .tr,
      "${ImagesPath.OnBoardingOne}"),
  onBoardingModel(
      "سرعة تجهيز الوجبة - أسرع من الصاروخ!".tr,
      " نحن نعلم أنك تحب الوجبات السريعة، ولكن لا تحب الانتظار. لهذا السبب، سموي يعمل لتجهيز طلبيتك بأعلى جودة وسرعة ممكنة ,سموي الأسرع والأفضل في تجهيز الوجبات السريعة. لا تقلق بشأن جودة الطعام أو النظافة، فنحن نضمن لك أن كل وجبة تصل إليك طازجة وساخنة ولذيذة. كل ما عليك فعله هو اختيار وجبتك، ودفع الثمن، ومتابعة حالة طلبك من خلال التطبيق.."
          .tr,
      "${ImagesPath.OnBoardingTwo}"),
  onBoardingModel(
      "سرعة إيصال الوجبة - لا تبتعد كثيراً".tr,
      "نحن نعلم أنك تريد الحصول على وجبتك السريعة في أسرع وقت ممكن، ولكن لا تريد الخروج من مكانك. لهذا السبب، سموي يوفر لك خدمة توصيل سريعة وموثوقة، تصل إلى أي مكان لموقعك . سواء كنت في منزلك أو مكتبك  أي مكان آخر، سموي يجدك ويصل إليك. كل ما عليك فعله هو تحديد موقعك على الخريطة، واختيار وجبتك، تقلق بشأن المسافة أو المرور، بل استمتع بوجبتك السريعة براحة."
          .tr,
      "${ImagesPath.OnBoardingThree}"),
];
