import 'package:get/get_navigation/src/root/internacionalization.dart';

class AppTranslation extends Translations {
  @override
  Map<String, Map<String, String>> get keys => {
        ///////////////////////////// Language /////////////////////////
        "ar": {
          /////////////Loading/////////////
          "1-أنتظر قليلًا": "انتظر قليلا",
          "2-سموي -  يخليك تحتار": "سموي -  يخليك تحتار",
          "3-تدور على أكل لذيذ وسريع  سموي هو التطبيق اللي يناسبك. سموي يوفرلك ألذ الوجبات السريعة من كل الأنواع والأذواق.. سموي يضملنك أن وجبتك تكون من أحسن مايكون وبجودة عالية .":
              "تدور على أكل لذيذ وسريع  سموي هو التطبيق اللي يناسبك. سموي يوفرلك ألذ الوجبات السريعة من كل الأنواع والأذواق.. سموي يضملنك أن وجبتك تكون من أحسن مايكون وبجودة عالية .",

          "4-سرعة تجهيز الوجبة - أسرع من الصاروخ!":
              "سرعة تجهيز الوجبة - أسرع من الصاروخ!",
          "5-نحن نعلم أنك تحب الوجبات السريعة، ولكن لا تحب الانتظار. لهذا السبب، سموي يعمل لتجهيز طلبيتك بأعلى جودة وسرعة ممكنة...":
              "نحن نعلم أنك تحب الوجبات السريعة، ولكن لا تحب الانتظار. لهذا السبب، سموي يعمل لتجهيز طلبيتك بأعلى جودة وسرعة ممكنة...",

          "6-سرعة إيصال الوجبة - لا تبتعد كثيراً":
              "سرعة إيصال الوجبة - لا تبتعد كثيراً",
          "7-نحن نعلم أنك تريد الحصول على وجبتك السريعة في أسرع وقت ممكن، ولكن لا تريد الخروج من مكانك. لهذا السبب، سموي يوفر لك خدمة توصيل سريعة وموثوقة، تصل إلى أي مكان لموقعك...":
              "نحن نعلم أنك تريد الحصول على وجبتك السريعة في أسرع وقت ممكن، ولكن لا تريد الخروج من مكانك. لهذا السبب، سموي يوفر لك خدمة توصيل سريعة وموثوقة، تصل إلى أي مكان لموقعك...",
          "8-الإنتقال": "الإنتقال",
          "9-المتابعة": "المتابعة",
          "10-ابحث عن اسم منتج ما": "ابحث عن اسم منتج ما",
          "11-قم لطفًا بإدخال الاسم": "قم لطفًا بإدخال الاسم",
          "12-الرئيسية": "الرئيسية",
          "13-السلة": "السلة",
          "14-الطلبيات": "الطلبيات",
          "15-الاعدادت": "الاعدادت",
          "16-سموي": "سموي",
          "17-ريال": "ريال",
          "18-يتم التحميل": "يتم التحميل",
          "19-تفاصيل المنتج": "تفاصيل المنتج",
          "20-الوصف": "الوصف",
          "21-الاضافات": "الاضافات",
          "22-لايوجد بيانات من عملية البحث": "لايوجد بيانات من عملية البحث",
          "23-الكمية والطلب": "الكمية والطلب",
          "24-قطعة": "قطعة",
          "25-إجمالي السعر:": "إجمالي السعر:",
          "26-يتم إحتساب كل قطعة مضاف إليها الإضافات":
              "يتم إحتساب كل قطعة مضاف إليها الإضافات",
          "27-إضافة للسلة": "إضافة للسلة",
          "28-إنهاء الطلب": "إنهاء الطلب",

          "29-تفاصيل العرض": "تفاصيل العرض",

          //////////////
          "12-الإعدادت": "الإعدادت",
          "13-معلومات الحساب": "معلومات الحساب",
          "15-موقعي": "موقعي",
          "16-التنبيهات": "التنبيهات",
          "17-معلومات حول سموي": "معلومات حول سموي",
          "17-اللغة": "اللغة",
          "18-تسجيل خروج": "تسجيل خروج",
          "19-حذف الحساب": "حذف الحساب",
          "20-الموقع والعمليات": "الموقع والعمليات",
          "21-يتم أخذ موقعك الحالي على الخريطة بشكل تلقائي وحفظه للقيام بعمليات الخدمة":
              "يتم أخذ موقعك الحالي على الخريطة بشكل تلقائي وحفظه للقيام بعمليات الخدمة",
          "22-إظهار موقعك": "إظهار موقعك",
          "23-تغيير الموقع": "تغيير الموقع",
          "24-انتظر قليلاً..يتم التحقق وأخذ الموقع الان":
              "انتظر قليلاً..يتم التحقق وأخذ الموقع الان",
          "25-هنالك خطأ...!": "هنالك خطأ...!",
          "26-خدمة -موقعي- غير مفعلة على جهازك..قم بتفعيلها ثم أعد المحاولة":
              "خدمة -موقعي- غير مفعلة على جهازك..قم بتفعيلها ثم أعد المحاولة",
          "27-تحديد موقعك على الخريطة": "تحديد موقعك على الخريطة",
          "28-يتم أخذ موقعك الحالي على الخريطة بشكل تلقائي وحفظه للقيام بعمليات الخدمة":
              "يتم أخذ موقعك الحالي على الخريطة بشكل تلقائي وحفظه للقيام بعمليات الخدمة",
          "29-أخذ موقعك الان": "أخذ موقعك الان",
          "30-يتم حذف موقعك حال حذف الحساب..لايتم إستغلال الموقع او أرشفته او تخزين في سيرفرات تخزين خارجية":
              "يتم حذف موقعك حال حذف الحساب..لايتم إستغلال الموقع او أرشفته او تخزين في سيرفرات تخزين خارجية",
          "31-انتظر قليلاً..يتم التحقق وأخذ الموقع الان":
              "انتظر قليلاً..يتم التحقق وأخذ الموقع الان",
          "32-هنالك خطأ...!": "هنالك خطأ...!",
          "33-خدمة -موقعي- غير مفعلة على جهازك..قم بتفعيلها ثم أعد المحاولة":
              "خدمة -موقعي- غير مفعلة على جهازك..قم بتفعيلها ثم أعد المحاولة",
          "34-لقد قمت برفض عملية التحصل على موقعك بشكل تلقائي..قم بالسماح للوصول لموقعك":
              "لقد قمت برفض عملية التحصل على موقعك بشكل تلقائي..قم بالسماح للوصول لموقعك",
          "35-انتهت العملية": "انتهت العملية",
          "36-لقد تم أخذ موقعك بنجاح": "لقد تم أخذ موقعك بنجاح",
          "37-مشاهدة الموقع الان": "الاخفاء الان",
          "38-معلومات الحساب": "معلومات الحساب",
          "39-اسم المستخدم:": "اسم المستخدم:",
          "40-رقم الهاتف:": "رقم الهاتف:",
          "55-موقعك على الخريطة": "موقعك على الخريطة",
          "56-عزيزي العميل..يتم أخذ لغه التطبيق الرئيسي عن طريق إستخدام لغة جهازك المُعتمدة في حال أردت تغيير اللغة أختر أحد الخيارات المتاحة":
              "عزيزي العميل..يتم أخذ لغه التطبيق الرئيسي عن طريق إستخدام لغة جهازك المُعتمدة في حال أردت تغيير اللغة أختر أحد الخيارات المتاحة",
          "56-اللغة العربية-الأختيار": "اللغة العربية-الأختيار",
          "57-اللغة الانجليزية-الأختيار": "اللغة الانجليزية-الأختيار",
          "58-الإنتقال": "الإنتقال",
          "59-لقد تم إضافة المنتج إلى السلة": "لقد تم إضافة المنتج إلى السلة",
          "60-يمكنك الإطلاع على قائمة السلة للإطلاع على المحتويات وتاكيد الطلبية":
              "يمكنك الإطلاع على قائمة السلة للإطلاع على المحتويات وتاكيد الطلبية",
          "61-الاخفاء": "الاخفاء",
          "62-مشاهدة السلة": "مشاهدة السلة",
          "63-معلومات حول العرض": "معلومات حول العرض",
          "64-تم إنشاء الطلبية بنجاح يمكنك مشاهدة الطلبية في قائمة طلبيات العروض":
              "تم إنشاء الطلبية بنجاح يمكنك مشاهدة الطلبية في قائمة طلبيات العروض",
          "65-التفاصيل": "التفاصيل",
          "66-السلة": "السلة",
          "67-الطلبية": "الطلبية",
          "68-في الطريق": "في الطريق",
          "69-التسليم": "التسليم",
          "70-حذف السلة": "حذف السلة",
          "71-إنشاء الطلبية": "إنشاء الطلبية",
          "72-الرجاء الإنتظار يتم إضافة الطلبية الان":
              "الرجاء الإنتظار يتم إضافة الطلبية الان",
          "73-قائمة الطلبيات": "قائمة الطلبيات",
          "74-طلبيات المنتجات": "طلبيات المنتجات",
          "75-طلبيات العروض": "طلبيات العروض",
          "76-رقم الطلبية:": "رقم الطلبية:",
          "77-إجمالي الطلبية:": "إجمالي الطلبية:",
          "78-ريال": "ريال",
          "79-حالة الطلبية:": "حالة الطلبية:",
          "80-تم التسليم": "تم التسليم",
          "81-مراجعة": "مراجعة",
          "82-التفاصيل": "التفاصيل",
          "83-يتم التحميل..قد لاتمتلك اي طلبيات لعرضها":
              "يتم التحميل..قد لاتمتلك اي طلبيات لعرضها",
          "211-عزيزي العميل لم تقم بإضافة عنوانك بعد":
              "عزيزي العميل لم تقم بإضافة عنوانك بعد",
          "165-ليس لديك حساب..لايمكنك القيام بهذة العملية":
              "ليس لديك حساب..لايمكنك القيام بهذة العملية",
          "166-الاخفاء": "الاخفاء",
          "167-تسجيل الدخول": "تسجيل الدخول",
          "200-عزيزي العميل لقد تم إنشاء الطلبية بنجاح":
              "عزيزي العميل لقد تم إنشاء الطلبية بنجاح",
          "201-يمكنك الإطلاع على الطلبية في قائمةالطلبيات  للإطلاع على المحتويات":
              "يمكنك الإطلاع على الطلبية في قائمةالطلبيات  للإطلاع على المحتويات",
          "202-الاخفاء": "الاخفاء",
          "203-يتم إضافة المنتج إلى السلة": "يتم إضافة المنتج إلى السلة",

          "204-الطلبية في الطريق": "الطلبية في الطريق",
          "205-طلبيتك الان بالطريق سيتم إشعارك حال وصولها من أجل إستلامها":
              "طلبيتك الان بالطريق سيتم إشعارك حال وصولها من أجل إستلامها",
          "206-إجمالي سعر الطلبية:": "إجمالي سعر الطلبية:",
          "207-تاريخ ووقت الطلب:": "تاريخ ووقت الطلب:",
          "208-التفاصيل": "التفاصيل",
          "209-السلة": "السلة",
          "210-الطلبية": "الطلبية",
          "211-في الطريق": "في الطريق",
          "212-التسليم": "التسليم",
          "213-محتويات الطلبية": "محتويات الطلبية",
          "214-يتم مراجعة الطلب...سيتم تاكيد العملية وإنتقالها في حال الإنتهاء من المراجعة وإشعارك":
              "يتم مراجعة الطلب...سيتم تاكيد العملية وإنتقالها في حال الإنتهاء من المراجعة وإشعارك",
          "215-الطلبية في الطريق": "الطلبية في الطريق",
          "216-طلبيتك الان بالطريق سيتم إشعارك حال وصولها من أجل إستلامها":
              "طلبيتك الان بالطريق سيتم إشعارك حال وصولها من أجل إستلامها",
          "217-رقم الطلبية:": "رقم الطلبية:",
          "218-إجمالي سعر الطلبية:": "إجمالي سعر الطلبية:",
          "219-محتويات السلة": "محتويات السلة",
          "220-سعر الخصم:": "سعر الخصم:",
          "221-إجمالي السعر:": "إجمالي السعر:",
          "222-حذف المنتج": "حذف المنتج",
          "223-قطعة": "قطعة",
          "224-المعذرة...ولكن لايوجد أي محتويات في السلة":
              "المعذرة...ولكن لايوجد أي محتويات في السلة",
          "225-تسجيل الدخول- التزامن": "تسجيل الدخول- التزامن",
          "226- رقم الهاتف المُدخل:": " رقم الهاتف المُدخل:",
          "227-عليك إدخال كود التحقق المرسل إلى رقمك بالأعلى..":
              "عليك إدخال كود التحقق المرسل إلى رقمك بالأعلى..",
          "228-كود التحقق": "كود التحقق",
          "229-لطفًا أدخل كود التحقق": "لطفًا أدخل كود التحقق",
          "230-المتابعة": "المتابعة",
          "231-يتم التحقق الان": "يتم التحقق الان",
          "232-لقد اتممت التحقق بنجاح ,,يمكنك الان من التوجة إلى الرئيسية ,شُكرا على صبرك":
              "لقد اتممت التحقق بنجاح ,,يمكنك الان من التوجة إلى الرئيسية ,شُكرا على صبرك",
          "233-التوجة الان": "التوجة الان",
          "234-عزيزي المستخدم هناك إشكالية,,الرجاء المحاولة مجددًا لاحقًا":
              "عزيزي المستخدم هناك إشكالية,,الرجاء المحاولة مجددًا لاحقًا",
          "235-الاخفاء": "الاخفاء",
          "236-تسجيل الدخول - التزامن": "تسجيل الدخول - التزامن",
          "237-مرحبًا بك مِن جديد...": "مرحبًا بك مِن جديد...",
          "238-رجاءًا قم بإدخال رقم الهاتف في الحقل التالي  للتقدم":
              "رجاءًا قم بإدخال رقم الهاتف في الحقل التالي  للتقدم",
          "239-لاتمتلك حساب؟": "لاتمتلك حساب؟",
          "240-قم بالإنشاء حساب الان": "قم بالإنشاء حساب الان",
          "241-عند الضغط على زر التزامن سيتم التحقق  من  رقم الهاتف  ,,رجاءًا تحلى بالصبر":
              "عند الضغط على زر التزامن سيتم التحقق  من  رقم الهاتف  ,,رجاءًا تحلى بالصبر",
          "242-التزامن الان": "التزامن الان",
          "243-انتظر قليلاً يتم التحقق الان": "انتظر قليلاً يتم التحقق الان",
          "244-تم بنجاح التحقق انقر للتقدم وإكمال عملية التزامن":
              "تم بنجاح التحقق انقر للتقدم وإكمال عملية التزامن",
          "245-التوجة الان": "التوجة الان",
          "246-عزيزي المستخدم رقم الهاتف غير متوفر!الرجاء إدخال رقم صحيح او إنشاء حساب جديد,,":
              "عزيزي المستخدم رقم الهاتف غير متوفر!الرجاء إدخال رقم صحيح او إنشاء حساب جديد,,",
          "247-الاخفاء": "الاخفاء",
          "248-الإنضمام للتطبيق": "الإنضمام للتطبيق",
          "249-نشكرك على طلب الإنضمام الرجاء إكمال التالي":
              "نشكرك على طلب الإنضمام الرجاء إكمال التالي",
          "250-عليك إدخال كود التحقق المرسل إلى رقمك بالأعلى..":
              "عليك إدخال كود التحقق المرسل إلى رقمك بالأعلى..",
          "251-لقد اتممت التحقق بنجاح ,,يمكنك الان من إدخال الاسم من أجل إكمال إنشاء الحساب ,شُكرا على صبرك":
              "لقد اتممت التحقق بنجاح ,,يمكنك الان من إدخال الاسم من أجل إكمال إنشاء الحساب ,شُكرا على صبرك",
          "252-التوجة الان": "التوجة الان",
          "253-عزيزي المستخدم هناك إشكالية,,الرجاء المحاولة مجددًا لاحقًا":
              "عزيزي المستخدم هناك إشكالية,,الرجاء المحاولة مجددًا لاحقًا",

          "254-يُسرنا إختيارك ورغبتك للانضمام لتطبيقنا للتمتع بمختلف المزايا المُقدمة لك":
              "يُسرنا إختيارك ورغبتك للانضمام لتطبيقنا للتمتع بمختلف المزايا المُقدمة لك",
          "255-بالفعل لديك حساب؟": "بالفعل لديك حساب؟",
          "256-قم بالتزامن الان": "قم بالتزامن الان",
          "257-عند الضغط على الزر سيتم التحقق من  رقم الهاتف  قبل إكمال عملية الإنضمام,,رجاءًا تحلى بالصبر":
              "عند الضغط على الزر سيتم التحقق من  رقم الهاتف  قبل إكمال عملية الإنضمام,,رجاءًا تحلى بالصبر",
          "258-التحقق الان": "التحقق الان",
          "259-انتظر قليلاً يتم التحقق الان": "انتظر قليلاً يتم التحقق الان",
          "260-تم بنجاح التحقق انقر للتقدم وإكمال عملية الإنضمام":
              "تم بنجاح التحقق انقر للتقدم وإكمال عملية الإنضمام",
          "261-التوجة الان": "التوجة الان",
          "262-عزيزي المستخدم هناك إشكالية,,الرجاء إعادة المحاولة مرة أخرى":
              "عزيزي المستخدم هناك إشكالية,,الرجاء إعادة المحاولة مرة أخرى",
          "263-الاخفاء": "الاخفاء",
          "264-لقد أوشكت على الانتهاء! فقط قم بإدخال أسمك لإكمال العملية":
              "لقد أوشكت على الانتهاء! فقط قم بإدخال أسمك لإكمال العملية",
          "265-عزيزي العميل أدخل أسمك هنا": "عزيزي العميل أدخل أسمك هنا",
          "266-اسم المستخدم": "اسم المستخدم",
          "267-لطفًا أدخل اسمك هنا": "لطفًا أدخل اسمك هنا",
          "268-الإنهاء": "الإنهاء",
          "269-يتم التحقق الان": "يتم التحقق الان",
          "270-لقد اتممت التحقق بنجاح ,,يمكنك الان من إدخال الاسم من أجل إكمال إنشاء الحساب ,شُكرا على صبرك":
              "لقد اتممت التحقق بنجاح ,,يمكنك الان من إدخال الاسم من أجل إكمال إنشاء الحساب ,شُكرا على صبرك",
          "271-التوجة الان": "التوجة الان",
          "272-عزيزي المستخدم هناك إشكالية,,الرجاء  المحاولة مجددًا لاحقًا":
              "عزيزي المستخدم هناك إشكالية,,الرجاء  المحاولة مجددًا لاحقًا",
          "273-الاخفاء": "الاخفاء",

          "274-مرحبًا بك في تطبيق سموي": "مرحبًا بك في تطبيق سموي",
          "275-يوصلك ساخن على الاخر وباجمل مذاق":
              "يوصلك ساخن على الاخر وباجمل مذاق",
          "276-قم بإختيار أحد المسارات التالية":
              "قم بإختيار أحد المسارات التالية",
          "277-تسجيل الدخول": "تسجيل الدخول",
          "278-المتابعة كزائر": "المتابعة كزائر",
          "279-يتم إنشاء الطلبية": "يتم إنشاء الطلبية",
          "280-عزيزي العميل لاتحتوي السلة على اي محتويات":
              "عزيزي العميل لاتحتوي السلة على اي محتويات",
          "281-لايمكنك فتح السلة كونها فارغة من اي محتويات..قم رجاءًا بإضافة عناصر لمشاهدة السلة":
              "لايمكنك فتح السلة كونها فارغة من اي محتويات..قم رجاءًا بإضافة عناصر لمشاهدة السلة"
        },

        "en": {
          "1-أنتظر قليلًا": "Wait a little",
          "2-سموي - يخليك تحتار": "Smoe - Makes you wonder",
          "3-تدور على أكل لذيذ وسريع  سموي هو التطبيق اللي يناسبك. سموي يوفرلك ألذ الوجبات السريعة من كل الأنواع والأذواق.. سموي يضملنك أن وجبتك تكون من أحسن مايكون وبجودة عالية .":
              "Looking for delicious and fast food? Smoe is the app for you. Smoe offers the tastiest fast food of all kinds and flavors, from burgers and pizza to falafel and shawarma. You can choose your favorite meal from a menu that has everything, and see the special additions... Smoe ensures that your meal is the best it can be and of high quality.",
          "4-سرعة تجهيز الوجبة - أسرع من الصاروخ!":
              "Meal preparation speed - Faster than a rocket!",
          "5-نحن نعلم أنك تحب الوجبات السريعة، ولكن لا تحب الانتظار. لهذا السبب، سموي يعمل لتجهيز طلبيتك بأعلى جودة وسرعة ممكنة...":
              "We know you love fast food, but you don't like to wait. That's why Smoe works to prepare your order with the highest quality and speed possible, making Smoe the fastest and best in preparing fast food. Don't worry about food quality or cleanliness, as we guarantee that every meal arrives fresh, hot, and delicious. All you have to do is choose your meal and track your order status through the app..",
          "6-سرعة إيصال الوجبة - لا تبتعد كثيراً":
              "Meal delivery speed - Don't go too far",
          "7-نحن نعلم أنك تريد الحصول على وجبتك السريعة في أسرع وقت ممكن، ولكن لا تريد الخروج من مكانك. لهذا السبب، سموي يوفر لك خدمة توصيل سريعة وموثوقة، تصل إلى أي مكان لموقعك...":
              "We know you want to get your fast food as quickly as possible, but you don't want to leave your place. That's why Smoe provides you with a fast and reliable delivery service that reaches any location. Whether you're at home, in the office, or anywhere else, Smoe finds you and delivers to you. All you have to do is set your location on the map, choose your meal, and don't worry about the distance or traffic, just enjoy your fast food comfortably.",
          "8-الإنتقال": "The Transition",
          "9-المتابعة": "The Follow-up",
          "10-ابحث عن اسم منتج ما": "Search for a product name",
          "11-قم لطفًا بإدخال الاسم": "Please kindly enter the name",
          "12-الرئيسية": "Home",
          "13-السلة": "Basket",
          "14-الطلبيات": "Orders",
          "15-الاعدادت": "Settings",
          "16-سموي": "Smoe",
          "17-معلومات حول سموي": "Information about Smoe",
          "17-اللغة": "Language",
          "17-ريال": "SAR",
          "18-يتم التحميل": "Loading",
          "19-تفاصيل المنتج": "Product Details",
          "20-الوصف": "Description",
          "21-الاضافات": "Add-ons",
          "22-لايوجد بيانات من عملية البحث": "No data from the search process",
          "23-الكمية والطلب": "Quantity and Order",
          "24-قطعة": "Piece",
          "25-إجمالي السعر:": "Total Price:",
          "26-يتم إحتساب كل قطعة مضاف إليها الإضافات":
              "Each piece added with add-ons is calculated",
          "27-إضافة للسلة": "Add to Basket",
          "28-إنهاء الطلب": "Complete the Order",
          "29-تفاصيل العرض": "Offer Details",
          "12-الإعدادت": "Settings",
          "13-معلومات الحساب": "Account Information",
          "15-موقعي": "My Location",
          "16-التنبيهات": "Notifications",
          "18-تسجيل خروج": "Log Out",
          "19-حذف الحساب": "Delete Account",
          "20-الموقع والعمليات": "Location and Operations",
          "21-يتم أخذ موقعك الحالي على الخريطة بشكل تلقائي وحفظه للقيام بعمليات الخدمة":
              "Your current location on the map is automatically taken and saved for service operations",
          "22-إظهار موقعك": "Show Your Location",
          "23-تغيير الموقع": "Change Location",
          "24-انتظر قليلاً..يتم التحقق وأخذ الموقع الان":
              "Wait a little.. Verification and location acquisition in progress",
          "25-هنالك خطأ...!": "There is an error...!",
          "26-خدمة -موقعي- غير مفعلة على جهازك..قم بتفعيلها ثم أعد المحاولة":
              "The -My Location- service is not activated on your device.. Activate it and then try again",
          "27-تحديد موقعك على الخريطة": "Set Your Location on the Map",
          "28-يتم أخذ موقعك الحالي على الخريطة بشكل تلقائي وحفظه للقيام بعمليات الخدمة":
              "Your current location on the map is automatically taken and saved for service operations",
          "29-أخذ موقعك الان": "Take Your Location Now",
          "30-يتم حذف موقعك حال حذف الحساب..لايتم إستغلال الموقع او أرشفته او تخزين في سيرفرات تخزين خارجية":
              "Your location is deleted when the account is deleted.. The location is not exploited, archived, or stored on external storage servers",
          "31-انتظر قليلاً..يتم التحقق وأخذ الموقع الان":
              "Wait a little.. Verification and location acquisition in progress",
          "32-هنالك خطأ...!": "There is an error...!",
          "33-خدمة -موقعي- غير مفعلة على جهازك..قم بتفعيلها ثم أعد المحاولة":
              "The -My Location- service is not activated on your device.. Activate it and then try again",
          "34-لقد قمت برفض عملية التحصل على موقعك بشكل تلقائي..قم بالسماح للوصول لموقعك":
              "You have automatically declined the process of obtaining your location.. Allow access to your location",
          "35-انتهت العملية": "The process is completed",
          "36-لقد تم أخذ موقعك بنجاح":
              "Your location has been successfully taken",
          "37-مشاهدة الموقع الان": "View the Location Now",
          "38-معلومات الحساب": "Account Information",
          "39-اسم المستخدم:": "Username:",
          "40-رقم الهاتف:": "Phone Number:",
          "55-موقعك على الخريطة": "Your Location on the Map",
          "56-عزيزي العميل..يتم أخذ لغه التطبيق الرئيسي عن طريق إستخدام لغة جهازك المُعتمدة في حال أردت تغيير اللغة أختر أحد الخيارات المتاحة":
              "Dear customer.. The main language of the application is taken by using the language of your device. If you want to change the language, choose one of the available options",
          "56-اللغة العربية-الأختيار": "Arabic Language-Choice",
          "57-اللغة الانجليزية-الأختيار": "English Language-Choice",
          "58-الإنتقال": "Transition",
          "59-لقد تم إضافة المنتج إلى السلة":
              "The product has been added to the basket",
          "60-يمكنك الإطلاع على قائمة السلة للإطلاع على المحتويات وتاكيد الطلبية":
              "You can view the basket list to see the contents and confirm the order",
          "61-الاخفاء": "Hide",
          "62-مشاهدة السلة": "View the Basket",
          "63-معلومات حول العرض": "Information about the Offer",
          "64-تم إنشاء الطلبية بنجاح يمكنك مشاهدة الطلبية في قائمة طلبيات العروض":
              "The order has been successfully created. You can view the order in the list of offer orders",
          "65-التفاصيل": "Details",
          "66-السلة": "Basket",
          "67-الطلبية": "Order",
          "68-في الطريق": "On the Way",
          "69-التسليم": "Delivery",
          "70-حذف السلة": "Delete the Basket",
          "71-إنشاء الطلبية": "Create the Order",
          "72-الرجاء الإنتظار يتم إضافة الطلبية الان":
              "Please wait, the order is being added now",
          "73-قائمة الطلبيات": "List of Orders",
          "74-طلبيات المنتجات": "Product Orders",
          "75-طلبيات العروض": "Offer Orders",
          "76-رقم الطلبية:": "Order Number:",
          "77-إجمالي الطلبية:": "Total Order:",
          "78-ريال": "SAR",
          "79-حالة الطلبية:": "Order Status:",
          "80-تم التسليم": "Delivered",
          "81-مراجعة": "Review",
          "82-التفاصيل": "Details",
          "83-يتم التحميل..قد لاتمتلك اي طلبيات لعرضها":
              "Loading.. You may not have any orders to display",
          "211-عزيزي العميل لم تقم بإضافة عنوانك بعد":
              "Dear customer, you have not added your address yet",
          "165-ليس لديك حساب..لايمكنك القيام بهذة العملية":
              "You do not have an account.. You cannot perform this operation",
          "166-الاخفاء": "Hide",
          "167-تسجيل الدخول": "Log In",
          "200-عزيزي العميل لقد تم إنشاء الطلبية بنجاح":
              "Dear customer, the order has been successfully created",
          "201-يمكنك الإطلاع على الطلبية في قائمةالطلبيات للإطلاع على المحتويات":
              "You can view the order in the order list to see the contents",
          "202-الاخفاء": "Hide",
          "203-يتم إضافة المنتج إلى السلة":
              "The product is being added to the basket",
          "204-الطلبية في الطريق": "The order is on the way",
          "205-طلبيتك الان بالطريق سيتم إشعارك حال وصولها من أجل إستلامها":
              "Your order is now on the way, you will be notified upon its arrival for receipt",
          "206-إجمالي سعر الطلبية:": "Total order price:",
          "207-تاريخ ووقت الطلب:": "Date and time of the order:",
          "208-التفاصيل": "Details",
          "209-السلة": "Basket",
          "210-الطلبية": "Order",
          "211-في الطريق": "On the way",
          "212-التسليم": "Delivery",
          "213-محتويات الطلبية": "Order contents",
          "214-يتم مراجعة الطلب...سيتم تاكيد العملية وإنتقالها في حال الإنتهاء من المراجعة وإشعارك":
              "The order is being reviewed... The process will be confirmed and transferred once the review is completed and you will be notified",
          "215-الطلبية في الطريق": "The order is on the way",
          "216-طلبيتك الان بالطريق سيتم إشعارك حال وصولها من أجل إستلامها":
              "Your order is now on the way, you will be notified upon its arrival for receipt",
          "217-رقم الطلبية:": "Order number:",
          "218-إجمالي سعر الطلبية:": "Total order price:",
          "219-محتويات السلة": "Basket contents",
          "220-سعر الخصم:": "Discount price:",
          "221-إجمالي السعر:": "Total price:",
          "222-حذف المنتج": "Delete product",
          "223-قطعة": "Piece",
          "224-المعذرة...ولكن لايوجد أي محتويات في السلة":
              "Sorry... but there are no contents in the basket",
          "225-تسجيل الدخول- التزامن": "Log in - Synchronization",
          "226- رقم الهاتف المُدخل:": " The entered phone number:",
          "227-عليك إدخال كود التحقق المرسل إلى رقمك بالأعلى..":
              "You must enter the verification code sent to your number above..",
          "228-كود التحقق": "Verification code",
          "229-لطفًا أدخل كود التحقق": "Please enter the verification code",
          "230-المتابعة": "Continue",
          "231-يتم التحقق الان": "Verification is in progress",
          "232-لقد اتممت التحقق بنجاح ,,يمكنك الان من التوجة إلى الرئيسية ,شُكرا على صبرك":
              "You have successfully completed the verification,, you can now head to the main page, thank you for your patience",
          "233-التوجة الان": "Head now",
          "234-عزيزي المستخدم هناك إشكالية,,الرجاء المحاولة مجددًا لاحقًا":
              "Dear user, there is an issue,, please try again later",
          "235-الاخفاء": "Hide",
          "236-تسجيل الدخول - التزامن": "Log in - Synchronization",
          "237-مرحبًا بك مِن جديد...": "Welcome back...",
          "238-رجاءًا قم بإدخال رقم الهاتف في الحقل التالي للتقدم":
              "Please enter the phone number in the following field to proceed",
          "239-لاتمتلك حساب؟": "Don't have an account?",
          "240-قم بالإنشاء حساب الان": "Create an account now",
          "241-عند الضغط على زر التزامن سيتم التحقق من رقم الهاتف ,,رجاءًا تحلى بالصبر":
              "When you press the synchronization button, the phone number will be verified,, please be patient",
          "242-التزامن الان": "Synchronize now",
          "243-انتظر قليلاً يتم التحقق الان":
              "Wait a little, verification is in progress now",
          "244-تم بنجاح التحقق انقر للتقدم وإكمال عملية التزامن":
              "Verification successful, click to proceed and complete the synchronization process",
          "245-التوجة الان": "Proceed now",
          "246-عزيزي المستخدم رقم الهاتف غير متوفر!الرجاء إدخال رقم صحيح او إنشاء حساب جديد,,":
              "Dear user, the phone number is not available! Please enter a correct number or create a new account,,",
          "247-الاخفاء": "Hide",
          "248-الإنضمام للتطبيق": "Join the application",
          "249-نشكرك على طلب الإنضمام الرجاء إكمال التالي":
              "Thank you for requesting to join, please complete the following",
          "250-عليك إدخال كود التحقق المرسل إلى رقمك بالأعلى..":
              "You must enter the verification code sent to your number above..",
          "251-لقد اتممت التحقق بنجاح ,,يمكنك الان من إدخال الاسم من أجل إكمال إنشاء الحساب ,شُكرا على صبرك":
              "You have successfully completed the verification,, you can now enter the name to complete the account creation, thank you for your patience",
          "252-التوجة الان": "Proceed now",
          "253-عزيزي المستخدم هناك إشكالية,,الرجاء المحاولة مجددًا لاحقًا":
              "Dear user, there is an issue,, please try again later",
          "254-يُسرنا إختيارك ورغبتك للانضمام لتطبيقنا للتمتع بمختلف المزايا المُقدمة لك":
              "We are pleased with your choice and desire to join our application to enjoy the various benefits offered to you",
          "255-بالفعل لديك حساب؟": "Do you already have an account?",
          "256-قم بالتزامن الان": "Synchronize now",
          "257-عند الضغط على الزر سيتم التحقق من رقم الهاتف قبل إكمال عملية الإنضمام,,رجاءًا تحلى بالصبر":
              "When you press the button, the phone number will be verified before completing the joining process,, please be patient",
          "258-التحقق الان": "Verify now",
          "259-انتظر قليلاً يتم التحقق الان":
              "Wait a little, verification is in progress now",
          "260-تم بنجاح التحقق انقر للتقدم وإكمال عملية الإنضمام":
              "Verification successful, click to proceed and complete the joining process",
          "261-التوجة الان": "Proceed now",
          "262-عزيزي المستخدم هناك إشكالية,,الرجاء إعادة المحاولة مرة أخرى":
              "Dear user, there is an issue,, please try again",
          "263-الاخفاء": "Hide",
          "264-لقد أوشكت على الانتهاء! فقط قم بإدخال أسمك لإكمال العملية":
              "You are almost finished! Just enter your name to complete the process",
          "265-عزيزي العميل أدخل أسمك هنا":
              "Dear customer, enter your name here",
          "266-اسم المستخدم": "Username",
          "267-لطفًا أدخل اسمك هنا": "Please enter your name here",
          "268-الإنهاء": "Finish",
          "269-يتم التحقق الان": "Verification is in progress now",
          "270-لقد اتممت التحقق بنجاح ,,يمكنك الان من إدخال الاسم من أجل إكمال إنشاء الحساب ,شُكرا على صبرك":
              "You have successfully completed the verification,, you can now enter the name to complete the account creation, thank you for your patience",
          "271-التوجة الان": "Proceed now",
          "272-عزيزي المستخدم هناك إشكالية,,الرجاء المحاولة مجددًا لاحقًا":
              "Dear user, there is an issue,, please try again later",
          "273-الاخفاء": "Hide",
          "274-مرحبًا بك في تطبيق سموي": "Welcome to the Smoe app",
          "275-يوصلك ساخن على الاخر وباجمل مذاق":
              "Delivers you hot to the last and with the most beautiful taste",
          "276-قم بإختيار أحد المسارات التالية":
              "Please choose one of the following paths",
          "277-تسجيل الدخول": "Log in",
          "278-المتابعة كزائر": "Continue as a guest",
          "279-يتم إنشاء الطلبية": "The order is being created",
          "280-عزيزي العميل لاتحتوي السلة على اي محتويات":
              "Dear customer, the basket contains no contents",
          "281-لايمكنك فتح السلة كونها فارغة من اي محتويات..قم رجاءًا بإضافة عناصر لمشاهدة السلة":
              "You cannot open the basket as it is empty of any contents.. Please add items to view the basket"
        }
      };
}
